Repository: ma-github-account/Web-App-Personnel-DB-with-multiple-languages-support-and-containerization
Catalog: personnel_db/locale/*/LC_MESSAGES/django.po
Languages: ar, es, hi

source: hello
ar: مرحبًا
es: Buenos Dias
hi: नमस्ते

source: Personnel Information Database
ar: قاعدة بيانات معلومات الموظفين
es: Base de datos de información de personal
hi: कार्मिक सूचना डेटाबेस

source: Language
ar: لغة
es: Idioma
hi: भाषा

source: How are you?
es: ¿Cómo estás?

source: Go to Main View
ar: انتقل إلى العرض الرئيسي
es: Ir a la vista principal
hi: मुख्य दृश्य पर जाएँ

source: Add New Personnel Record
ar: إضافة سجل موظف جديد
es: Agregar nuevo registro de personal
hi: नया कार्मिक रिकॉर्ड जोड़ें

source: Fill the form to add new contact
ar: إملأ النموذج لإضافة جهة اتصال جديدة
es: Rellena el formulario para añadir nuevo contacto
hi: नया संपर्क जोड़ने के लिए फ़ॉर्म भरें

source: Personal Data Details
ar: تفاصيل الاتصال
es: Datos de contacto
hi: सम्पर्क करने का विवरण

source: First Name
ar: الاسم الأول
es: Nombre de pila
hi: पहला नाम

source: Last Name
ar: اسم العائلة
es: Apellido
hi: उपनाम

source: Personal Phone
ar: هاتف شخصي
es: Teléfono Personal
hi: व्यक्तिगत फ़ोन

source: Work Phone
ar: هاتف العمل
es: Teléfono del Trabajo
hi: ऑफिस का फोन

source: Address
ar: عنوان
es: Dirección
hi: पता

source: Personnel Information
ar: معلومات شخصية
es: Información Personal
hi: कार्मिक जानकारी

source: This is a Personnel Information Database. Records contain first name, last name, personal phone number, work phone number and the address. Link at the end leads to detail view. There is a possibility to add new record. If you wish to do so, the link is below the table.
ar: هذه قاعدة بيانات لمعلومات الموظفين. تحتوي السجلات على الاسم الأول واسم العائلة ورقم الهاتف الشخصي ورقم هاتف العمل والعنوان. يؤدي الرابط الموجود في النهاية إلى عرض تفصيلي. هناك إمكانية لإضافة سجل جديد. إذا كنت ترغب في ذلك، فإن الرابط موجود أسفل الجدول.
es: Esta es una base de datos de información de personal. Los registros contienen nombre, apellido, número de teléfono personal, número de teléfono del trabajo y dirección. El enlace al final lleva a la vista de detalles. Existe la posibilidad de agregar un nuevo registro. Si lo desea, el enlace se encuentra debajo de la tabla.
hi: यह एक कार्मिक सूचना डेटाबेस है। रिकॉर्ड में पहला नाम, अंतिम नाम, व्यक्तिगत फ़ोन नंबर, कार्य फ़ोन नंबर और पता शामिल है। अंत में लिंक विस्तृत दृश्य की ओर ले जाता है। नया रिकॉर्ड जोड़ने की संभावना है। यदि आप ऐसा करना चाहते हैं, तो लिंक तालिका के नीचे है।

source: First name
ar: الاسم الأول
es: Nombre de pila
hi: पहला नाम

source: Last name
ar: اسم العائلة
es: Apellido
hi: उपनाम

source: Link to details
ar: رابط للتفاصيل
es: Enlace a los detalles
hi: विवरण के लिए लिंक

source: Contact details
ar: تفاصيل الاتصال
es: Datos de contacto
hi: सम्पर्क करने का विवरण

source: Add new contact
ar: إضافة جهة اتصال جديدة
es: Agregar nuevo contacto
hi: नए संपर्क को जोड़े
